# 算术运算符 ： + — * / // % **
print("10 + 4 = ", 10 + 4) # 加
print("10 - 4 = ", 10 - 4) # 减
print("10 * 4 = ", 10 * 4) # 乘
print("10 / 4 = ", 10 / 4) # 除(结果为浮点数)
print("10 // 4 = ", 10 // 4) # 整除(结果为整数)
print("10 % 4 = ", 10 % 4) # 取余/求模
print("10 ** 4 = ", 10 ** 4) # 幂指数,10的4次方
# 括号里的双引号部分是字符串,直接输出,后面是计算式子,只输出结果


# 算数运算符的优先级--> **  --> * / // %  --> + -  (括号的优先级是最高的)
print("0.1 + 10 / 4**2 = ", 0.1 + 10 / 4**2)


# 案例1:输入两个数 x 与 y ,计算 x + y 以及 x - y 的结果并输出
# input输出的都是字符串,所以需要转换.并且int只能输入整数,所以用float(..)--->将其他类型 转为 浮点数类型(可整可小数)
x = float(input("请输入x的值: "))
y = float(input("请输入y的值: "))

# 0.09999999999999998 --> 精度损失:由于计算机底层是基于 二进制 进行数据的存储和处理,二进制无法准确的表示所有小数,因此设计到浮点数的运算,可能会损失精度

print("x + y = ", x + y)
print("x - y = ", x - y)

print(type(x))
print(type(y))


# 作业1:计算输入的三个整数的平均值
x = int(input("输入x的值:"))
y = int(input("输入y的值:"))
z = int(input("输入z的值:"))
print("(x + y + z) / 3 = " , (x + y + z) / 3)


# 作业2:要求输入梯形的上底,下底,高,然后计算梯形的面积
a = float(input("输入梯形的上底:"))
b = float(input("输入梯形的下底:"))
h = float(input("输入梯形的高:"))
print("梯形的面积:(a + b) * h / 2 = " ,(a + b) * h / 2)

# 作业3:要求输入圆的半径,然后计算圆的周长和面积 (周长:2πr, 面积:πr²)
r = float(input("输入圆的半径:"))
pi = 3.14159
print("圆的周长:2πr = ",2*pi*r)
print("圆的面积:πr² = ",pi*r**2)
import math
print(math.pi)
      
# 作业4:身体质量指数BMI的计算(BMI = 体重(kg) / 身高(m)²)
a = float(input("输入体重(单位kg):"))
b = float(input("输入身高(单位m):"))
print("BMI : a / b² =",a / b**2)



# 赋值运算符：=  +=  /=  *=  %=  //=  **=
num = 85

num += 10  # num = num + 10
print("num += 10 后,num = ",num) #95

num -= 10
print("num -= 10 后,num = ",num) #85

num *= 10
print("num *= 10 后,num = ",num) #850

num /= 10
print("num /= 10 后,num = ",num) #85.0

num //= 10
print("num //= 10 后,num = ",num) # 8.0

num %= 3
print("num %= 3 后,num = ",num) # 2.0

num **= 3
print("num **= 3 后,num = ",num) # 8.0



# 比较运算符(关系运算符)---->返回布尔值(True表示比较关系成立,False则反之)
print("100 == 100 吗 : ", 100 == 100)
print("'100' == '100' 吗 : ", '100' == '100')
print("100 != 100 吗 : ", 100 != 100)

print("100 > 100 吗 : ", 100 > 100)
print("100 >= 100 吗 : ", 100 >= 100)

print("100 < 100 吗 : ", 100 < 100)
print("100 <= 100 吗 : ", 100 <= 100)


# 思考1:数学计算中,判断一个数是否为偶数,是用哪个关系运算符呢?
#num % 2 == 0

# 思考2:电商项目的支付功能业务,需要判断银行卡余额是否足够,是用哪个关系运算符呢?
#>=

# 思考3:电商项目的购买商品业务,需要判断货物的库存是否足够,是用哪个关系运算符呢?
#>=

# 思考4:点餐项目的筛选商品业务,需要点不超过100元的商品,使用哪个关系运算符呢?
#<=


# 逻辑运算符----> and  or  not
# 案例1:键盘输入一个整数,判断这个数是否在10-20之间--->在: True,不在: False
n = int(input("请输入一个整数:"))

print(f"{n}在10-20之间: ",n >= 10 and n <= 20) #and连接的条件是并且的关系,两个条件同时成立(True),结果才是True;否则,结果为False
print(f"{n}在10-20之间: ",10 <= n <= 20) 



# 案例2:键盘输入一个整数,判断这个数是否不在10-20之间
n = int(input("请输入一个整数:"))
print(f"{n}是否不在10-20之间: ",n<10 or n>20) #or连接的条件是或者的关系,其中一个条件符合,结果就是True